## PAIR PROGRAMMING ETL IV

### ETL Carga I - Creaci칩n BBDD e inserci칩n de datos
---

Es el momento de meter todos nuestros datos en SQL 游눩游낗!!! En este ejercicio nos crearemos dos tablas en una BBDD creada por nosotras. Una de las tablas contendr치 la informaci칩n que obtuvimos de los ejercicios de pair programming de Limpieza, es decir, el data set de ataques de tiburones limpito. La segunda tabla tendr치 la informaci칩n obtenida en el ejercicio de pair de ETL 1.

游늷 Nota Todo lo tendremos que hacer desde jupyter notebook

**EJERCICIO 1**

Cread la BBDD con el nombre de tiburones.

In [1]:
import pandas as pd
import mysql.connector

In [2]:
def crear_bbdd(nombre_bbdd):

    mydb = mysql.connector.connect(
      host="localhost",
      user="root",
      password="AlumnaAdalab")
      
    print("Conexi칩n realizada con 칠xito")
    
    mycursor = mydb.cursor()

    try:
        mycursor.execute(f"CREATE DATABASE IF NOT EXISTS {nombre_bbdd};")
        print(mycursor)
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

In [3]:
mydb = crear_bbdd("tiburones")

InterfaceError: 2003: Can't connect to MySQL server on 'localhost:3306' (111 Connection refused)

---

**EJERCICIO 2**

Cread las tablas de la BBDD:
- Tabla ataques
- Tabla clima

In [ ]:
def crear_insertar_tabla(nombre_bbdd, contrase침a, query):
    
   
    cnx = mysql.connector.connect(user='root', password=f"{contrase침a}",
                                     host='127.0.0.1', database=f"{nombre_bbdd}")
   
    mycursor = cnx.cursor()
    
    
    try: 
        mycursor.execute(query)
        cnx.commit() 
   
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

In [ ]:
df_attacks= pd.read_pickle('../files/attacks12.pickle')
df_attacks.head(2)

,case_number,type,country,activity,age,species_,date,mes_ataque,fatal,sexo,cat_species,mes,year,edades
0,1800.00.00,Unprovoked,seychelles,a corsair's boat was overturned,NaN,NaN,1800,NaN,Y,F,NaN,NaN,1997.0,27.878808
1,1797.05.28.R,Unprovoked,NaN,Dropped overboard,NaN,NaN,Reported May-28-1797,May,Y,M,NaN,May,1997.0,27.878808

In [ ]:
df_attacks.columns #Verificamos los nombres de las columnas para crear la tabla

Index(['case_number', 'type', 'country', 'activity', 'age', 'species_', 'date',
       'mes_ataque', 'fatal', 'sexo', 'cat_species', 'mes', 'year', 'edades'],
      dtype='object')

In [ ]:
df_attacks.dtypes # Verificamos los tipos de datos.

case_number     object
type            object
country         object
activity        object
age             object
species_        object
date            object
mes_ataque      object
fatal           object
sexo            object
cat_species     object
mes             object
year           float64
edades         float64
dtype: object

In [ ]:
df_attacks.isnull().sum() # Chequeamos si la columna tiene nulos.

case_number      0
type             0
country         10
activity        31
age            154
species_       126
date             0
mes_ataque     141
fatal           97
sexo             0
cat_species    126
mes            170
year             0
edades           0
dtype: int64

In [ ]:
query_attacks= '''
CREATE TABLE IF NOT EXISTS `tiburones`.`ataques` (
`id_ataque` INT NOT NULL AUTO_INCREMENT,
`case_number` VARCHAR(45),
`type` VARCHAR(45),
`country` VARCHAR(45),
`activity` VARCHAR(100), 
`age` VARCHAR(45),
`species_` VARCHAR(100),
`date` VARCHAR(45),
`mes_ataque` VARCHAR(45), 
`fatal` VARCHAR(45), 
`sexo` VARCHAR(45), 
`cat_species` VARCHAR(45), 
`mes` VARCHAR(45),
`year` FLOAT , 
`edades` FLOAT,
  PRIMARY KEY (`id_ataque`,`country`))
ENGINE = InnoDB;
'''

In [ ]:
df_clima = pd.read_csv('../files/datos_clima_paises_2.csv', index_col=0)
df_clima.head(2)

,country,speed950mb,speed900mb,speed850mb,speed800mb,speed750mb,speed700mb,speed650mb,speed600mb,speed550mb,...,temp2m,rh2m,weather,wind10m.direction,wind10m.speed,highcloud,midcloud,lowcloud,msl_pressure,snow_depth
0,australia,3.656250,3.515625,3.4375,3.328125,3.375000,3.359375,3.250000,3.375000,3.578125,...,25.9375,10.859375,NaN,117.578125,3.234375,-9999.0,-9999.0,-9999.0,1015.0625,0.0
1,new zealand,3.734375,3.640625,3.5625,3.703125,3.671875,3.687500,3.734375,3.859375,3.968750,...,15.1875,11.156250,NaN,166.093750,3.390625,-9999.0,-9999.0,-9999.0,1015.8750,0.0

In [ ]:
df_clima.columns

Index(['country', 'speed950mb', 'speed900mb', 'speed850mb', 'speed800mb',
       'speed750mb', 'speed700mb', 'speed650mb', 'speed600mb', 'speed550mb',
       'speed500mb', 'speed450mb', 'speed400mb', 'speed350mb', 'speed300mb',
       'speed250mb', 'speed200mb', 'direction200mb', 'direction250mb',
       'direction300mb', 'direction350mb', 'direction400mb', 'direction450mb',
       'direction500mb', 'direction550mb', 'direction600mb', 'direction650mb',
       'direction700mb', 'direction750mb', 'direction800mb', 'direction850mb',
       'direction900mb', 'direction950mb', 'rh_950mb', 'rh_900mb', 'rh_850mb',
       'rh_800mb', 'rh_750mb', 'rh_700mb', 'rh_650mb', 'rh_600mb', 'rh_550mb',
       'rh_500mb', 'rh_450mb', 'rh_400mb', 'rh_350mb', 'rh_300mb', 'rh_250mb',
       'rh_200mb', 'timepoint', 'cloudcover', 'lifted_index', 'prec_amount',
       'temp2m', 'rh2m', 'weather', 'wind10m.direction', 'wind10m.speed',
       'highcloud', 'midcloud', 'lowcloud', 'msl_pressure', 'snow_depth'],
      dtype='object')

In [ ]:
df_clima.isnull().sum()

country         0
speed950mb      0
speed900mb      0
speed850mb      0
speed800mb      0
               ..
highcloud       0
midcloud        0
lowcloud        0
msl_pressure    0
snow_depth      0
Length: 63, dtype: int64

In [ ]:
df_clima.dtypes

country          object
speed950mb      float64
speed900mb      float64
speed850mb      float64
speed800mb      float64
                 ...
highcloud       float64
midcloud        float64
lowcloud        float64
msl_pressure    float64
snow_depth      float64
Length: 63, dtype: object

In [ ]:
query_clima= '''CREATE TABLE IF NOT EXISTS `tiburones`.`clima` (
`id_clima` INT NOT NULL AUTO_INCREMENT,
`country` VARCHAR(45) NOT NULL,
`speed950mb` FLOAT NOT NULL,
`speed900mb` FLOAT NOT NULL,
`speed850mb` FLOAT NOT NULL,
`speed800mb` FLOAT NOT NULL,
`speed750mb` FLOAT NOT NULL,
`speed700mb` FLOAT NOT NULL,
`speed650mb` FLOAT NOT NULL,
`speed600mb` FLOAT NOT NULL,
`speed550mb` FLOAT NOT NULL,
`speed500mb` FLOAT NOT NULL,
`speed450mb` FLOAT NOT NULL,
`speed400mb` FLOAT NOT NULL,
`speed350mb` FLOAT NOT NULL,
`speed300mb` FLOAT NOT NULL,
`speed250mb` FLOAT NOT NULL,
`speed200mb` FLOAT NOT NULL,
`direction950mb` FLOAT NOT NULL,
`direction900mb` FLOAT NOT NULL,
`direction850mb` FLOAT NOT NULL,
`direction800mb` FLOAT NOT NULL,
`direction750mb` FLOAT NOT NULL,
`direction700mb` FLOAT NOT NULL,
`direction650mb` FLOAT NOT NULL,
`direction600mb` FLOAT NOT NULL,
`direction550mb` FLOAT NOT NULL,
`direction500mb` FLOAT NOT NULL,
`direction450mb` FLOAT NOT NULL,
`direction400mb` FLOAT NOT NULL,
`direction350mb` FLOAT NOT NULL,
`direction300mb` FLOAT NOT NULL,
`direction250mb` FLOAT NOT NULL,
`direction200mb` FLOAT NOT NULL,
`rh_950mb` FLOAT NOT NULL,
`rh_900mb` FLOAT NOT NULL,
`rh_850mb` FLOAT NOT NULL,
`rh_800mb` FLOAT NOT NULL,
`rh_750mb` FLOAT NOT NULL,
`rh_700mb` FLOAT NOT NULL,
`rh_650mb` FLOAT NOT NULL,
`rh_600mb` FLOAT NOT NULL,
`rh_550mb` FLOAT NOT NULL,
`rh_500mb` FLOAT NOT NULL,
`rh_450mb` FLOAT NOT NULL,
`rh_400mb` FLOAT NOT NULL,
`rh_350mb` FLOAT NOT NULL,
`rh_300mb` FLOAT NOT NULL,
`rh_250mb` FLOAT NOT NULL,
`rh_200mb` FLOAT NOT NULL,
`timepoint` FLOAT NOT NULL, 
`cloudcover` FLOAT NOT NULL, 
`lifted_index` FLOAT NOT NULL, 
`prec_amount` FLOAT NOT NULL,
`temp2m` FLOAT NOT NULL, 
`rh2m` FLOAT NOT NULL, 
`weather` FLOAT NOT NULL, 
`wind10m.direction` FLOAT NOT NULL, 
`wind10m.speed` FLOAT NOT NULL,
`highcloud` FLOAT NOT NULL, 
`midcloud` FLOAT NOT NULL, 
`lowcloud` FLOAT NOT NULL, 
`msl_pressure` FLOAT NOT NULL, 
`snow_depth` FLOAT NOT NULL,
`fecha' DATE,
PRIMARY KEY (`id_clima`, `country`)
INDEX `country_idx` (`country` ASC) VISIBLE
CONSTRAINT `country`
FOREIGN KEY (`country`)
REFERENCES `tiburones`.`ataques` (`country`)
ON DELETE CASCADE
ON UPDATE CASCADE)
ENGINE = InnoDB;'''

In [ ]:
crear_insertar_tabla('tiburones',  'AlumnaAdalab', query_attacks)

In [ ]:
crear_insertar_tabla('tiburones',  'AlumnaAdalab', query_clima)

1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'INDEX `country_idx` (`country` ASC) VISIBLE,
CONSTRAINT `country`
FOREIGN KEY (`' at line 67
Error Code: 1064
SQLSTATE 42000
Message You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'INDEX `country_idx` (`country` ASC) VISIBLE,
CONSTRAINT `country`
FOREIGN KEY (`' at line 67

---

**BONUS** 

Insertar los datos en las tablas.
游늷 Nota Esta parte del pair es optativa y no ser치 considerada para la evaluaci칩n

游뚿 En caso de que no teng치is los datos unidos de la sesi칩n anterior, ten칠is un csv datos_union_clima_ataques con todos los datos que necesitareis para este ejercicio